InformationRegisters/РегистрацияСобытийПрямогоОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияСобытийПрямогоОбменаДанными</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПрямогоОбменаДанными</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыПрямогоОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегистрацияСобытийПрямогоОбменаДанными/Ext/ManagerModule.bsl
Функция ПодготовитьСобытиеПрямогоОбмена(ИмяСобытия = "") Экспорт
	
	ЗначениеВозврата = новый Структура();
	ЗначениеВозврата.Вставить("УзелПрямогоОбменаДанными","");
	ЗначениеВозврата.Вставить("ИмяСобытия", ИмяСобытия);
	ЗначениеВозврата.Вставить("Период", ТекущаяДата());
	ЗначениеВозврата.Вставить("Результат", "");
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Процедура ЗаписатьСобытиеПрямогоОбмена(ДанныеУзла, ДанныеСобытия) Экспорт
	
	МенеджерРегистра = РегистрыСведений.РегистрацияСобытийПрямогоОбменаДанными;
	МенеджерЗаписи = МенеджерРегистра.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.УзелПрямогоОбменаДанными = ДанныеУзла;
	МенеджерЗаписи.ИмяСобытия = ДанныеСобытия.ИмяСобытия;
	МенеджерЗаписи.Период = ДанныеСобытия.Период;
	МенеджерЗаписи.Результат = ДанныеСобытия.Результат;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры
